Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: (You’ll learn more about the product module name later, in Naming Your Product Module.)
ja: （あなたは後で製品モジュール名について「あなたの製品モジュールに名前をつける」でさらに学びます。）

source: // Configure cell
ja: （セルを構成設定する）

source: // Insert code here to add functionality to your managed object subclass
ja: （コードをここに挿入して機能性をあなたの管理オブジェクトサブクラスに加えます）

source: // Method is available for use.
ja: （メソッドは利用に応じられます。）

source: // Method is not available.
ja: （メソッドは利用できません。）

source: // Not a compile-time error because NSDictionary has this selector.
ja: （コンパイル時エラーでは無い、なぜならNSDictionaryはこのセレクタを持つからです。）

source: // Raises an exception because NSArray does not respond to this selector.
ja: （例外を引き起こします、なぜならNSArrayはこのセレクタに応答しないからです。）

source: // amenities is an NSSet object containing three values
ja: （amenitiesは３つの値を含んでいるNSSetオブジェクトです）

source: // code that creates autoreleased objects.
ja: （オートリリースされるオブジェクトを作成するコード）

source: // conditional branch not executed
ja: （条件分岐は実行されません）

source: // could not load the image
ja: （画像を読み込めなかった）

source: // crash, myObject doesn't respond to that method
ja: （失敗、myObjectはこのメソッドに応答することができません）

source: // define the class
ja: （クラスを定義する）

source: // error: only available on iOS 8.0 or newer
ja: （エラー：iOS 8.0以降でのみ利用可能）

source: // loaded the image successfully
ja: （画像をうまく読み込んだ）

source: // medalRankings is an NSDictionary object containing three key-value pairs
ja: （medalRankingsは、NSDictionaryオブジェクトでキー値ペアを含んでいます）

source: // memoryManagedResult is a memory managed CFString
ja: （memoryManagedResultは、メモリ管理されるCFStringです）

source: // myChar has unichar? type and nil value
ja: （myCharはunichar?型でNSDatenilを持ちます）

source: // myCount has Int? type and nil value
ja: （myCountはInt?型でnil値を持ちます）

source: // myObject has AnyObject type and NSDate value
ja: （myObjectはAnyObject型でNSDate値を持ちます）

source: // object conforms to UITableViewDataSource and is bound to dataSource
ja: （オブジェクトは、UITableViewDataSourceに準拠して、dataSourceに結束されます）

source: // object could not be cast to type UIButton
ja: （オブジェクトは、型UIButtonにキャストされることができませんでした）

source: // object is not of type UIButton
ja: （オブジェクトは、型UIButtonではありません）

source: // object is of type UIButton
ja: （オブジェクトは、型UIButtonです）

source: // object is successfully cast to type UIButton and bound to button
ja: （オブジェクトは、型UIButtonにうまくキャストされて、buttonに束縛されます）

source: // object not conform to UITableViewDataSource
ja: （オブジェクトは、UITableViewDataSourceに準拠しません）

source: // offsetPointer is 24 strides ahead of pointer
ja: （offsetPointerは、pointerの前方24ストライドです）

source: // play song or throw an error if unavailable
ja: （曲を再生するか利用可能でないならばエラーをスローする）

source: // schoolSupplies is an NSArray object containing three values
ja: （schoolSuppliesは３つの値を含んでいるNSArrayオブジェクトです）

source: >= followed by a version number
ja: >=にバージョン番号が続きます

source: NSString methods that express length, character indexes, or ranges in terms of 16-bit platform-endian values have corresponding Swift String methods that use String.Index and Range<String.Index> values rather than Int and NSRange values.
ja: 16ビットのプラットホームエンディアンの値の観点から長さ、文字インデックス、または範囲を表すNSStringメソッドは、対応するスウィフトのStringメソッドを持ちます、それはString.IndexとRange<String.Index>値を使います、IntとNSRange値ではなくて。

source: Extensions expand the behavior of existing classes, structures, and enumerations, including those defined in Objective-C.
ja: 拡張は、既存のクラス、構造体、そして列挙の挙動を、Objective-Cで定義されるそれらを含めて、発展させます。

source: Interoperability is the ability to interface between Swift and Objective-C in either direction, letting you access and use pieces of code written in one language in a file of the other language.
ja: 相互運用性は、スウィフトとObjective-Cの間でどちらの方向からでも調和させ、あなたに一方の言語で書かれるコード断片を他方の言語のファイルの中でアクセスおよび使用させる能力です。

source: Migration provides an opportunity to revisit an existing Objective-C app and improve its architecture, logic, and performance by replacing pieces of it in Swift.
ja: 移行は、既存のObjective-Cアプリを再検討するための、およびその設計仕様、論理、そして性能をそれの一部をスウィフトにおいて取り替えることによって向上させるための機会を提供します。

source: Interoperability lets you interface between Swift and Objective-C code, allowing you to use Swift classes in Objective-C and to take advantage of familiar Cocoa classes, patterns, and practices when writing Swift code.
ja: 相互運用性は、あなたにスウィフトとObjective-Cコードの間を円滑に相互運用させて、スウィフトクラスをObjective-Cにおいて使用できるように、そしてスウィフトコードを書く場合には、よく知られているココア・クラス、パターン、および慣行を利用できるようにします。

source: Migration from existing Objective-C code to Swift is made easy with interoperability and mix and match, making it possible to replace parts of your Objective-C apps with the latest Swift features.
ja: 移行。既存のObjective-Cコードからスウィフトへの移行は、相互運用性および混合と適合によって簡単にされます、そして、あなたのObjective-Cアプリの一部を最新のスウィフト特徴で取り替えることを可能にします。

source: Mix and match allows you to create mixed-language apps containing both Swift and Objective-C files that can communicate with each other.
ja: 混合と適合は、あなたにお互いと通信することができるスウィフトとObjective-Cファイルを含んでいる混合言語アプリを作成することを可能にします。

source: // Received an NSNull value.
ja: （NSNull値を受け取った。）

source: // lastRefreshDate is of type Any?
ja: （lastRefreshDateは型Any?です）

source: A String value, if Type is Int8 or UInt8.
ja: ひとつのString値、TypeがInt8またはUInt8であるならば。

source: A [Type] value, which is passed as a pointer to the start of the array.
ja: ひとつの[Type]値、それは配列の始まりへのポインターとして渡されます。

source: A buffer pointer is used for low-level access to a region of memory.
ja: バッファポインタは、メモリのある領域への低水準アクセスのために使われます。

source: A compilation condition can include the literal true and false values, custom conditional compilation flags (specified using -D <#flag#>), and the platform conditions listed in the table below.
ja: コンパイル条件は、リテラルのtrueとfalse値、誂えの条件コンパイルフラグ（-D <#flag#>を使って指定される）、そして以下の表で一覧にされるプラットホーム条件を含むことができます、

source: A lazy property is a property whose underlying value is only initialized when the property is first accessed.
ja: 遅延プロパティは、それの裏に潜んだ値が初期化されるのがそのプロパティが最初にアクセスされる時にして初めてというプロパティです。

source: A key path is a string of dot-separated keys that specifies a sequence of object properties to traverse.
ja: キーパスは、ドットで区切られたいくらかのキーからなる文字列で、巡回していく一連のオブジェクトプロパティを指定するものです。

source: A C enumeration that is not marked with the NS_ENUM or NS_OPTIONS macro is imported as a Swift structure.
ja: NS_ENUMまたはNS_OPTIONSマクロで印されないC列挙は、スウィフト構造体としてインポートされます。

source: A Swift app target is a module itself, so the fully qualified name of a Swift class named Observer in an app called MyGreatApp is MyGreatApp.Observer.
ja: あるスウィフトアプリ・ターゲートは、あるモジュールそれ自体です、なのでMyGreatAppと呼ばれるあるアプリの中のObserverと命名されるあるスウィフトクラスの完全修飾名は、MyGreatApp.Observerです。

source: A Swift class must be a descendant of an Objective-C class to be accessible and usable in Objective-C.
ja: スウィフトクラスは、Objective-Cにおいてアクセス可能および利用可能であるためにはObjective-Cクラスの子孫でなければなりません。

source: A Swift extension is similar to an Objective-C category.
ja: スウィフトの拡張は、Objective-Cのカテゴリーに似ています。

source: A Swift project’s structure is nearly identical to an Objective-C project, with one important distinction: Swift has no header files.
ja: スウィフトプロジェクトの構造は、Objective-Cプロジェクトにほとんど同一ですが、１つの重要な違いがあります：スウィフトには、ヘッダ・ファイルがありません。

source: A Swift subclass gets all the functionality offered by the superclass in Objective-C.
ja: スウィフトのサブクラスは、Objective-Cでのスーパークラスによって提供される全ての機能性を獲得します。

source: A key-path expression accepts property references and chained property references, such as \Animal.name.count.
ja: キーパス式は、プロパティ参照そして数珠つなぎにされたプロパティ参照を受け入れます、例えば\Animal.name.countのように。

source: A method annotated with the @available attribute can safely use APIs available to the specified platform requirements without the use of an explicit availability check.
ja: @available属性で注釈を付けられるメソッドは、指定されたプラッホーム要件で利用可能なAPIを明確に有効性確認を使うことなく安全に使用できます。

source: A non-optional pointer type cannot be assigned a nil value.
ja: 非オプショナルポインタ型は、nil値を割り当てられることはできません。

source: A parameterized class written in Objective-C is imported into Swift as a generic class with the same number of type parameters.
ja: Objective-Cにおいて書かれたパラメータ化されたクラスは、同じ数の型パラメータを持つ総称体クラスとしスウィフトにインポートされます。

source: A protocol declares all initializers, properties, subscripts, and methods that an Objective-C class must implement in order to conform to the protocol.
ja: プロトコルは、Objective-Cクラスがそのプロトコルに準拠するために実装しなければならない全てのイニシャライザ、プロパティ、添え字、そしてメソッドを宣言します。

source: API Availability
ja: API有効性

source: Accessing Properties
ja: プロパティにアクセスする

source: Accessing arguments using CommandLine.arguments is equivalent to accessing the arguments property on ProcessInfo.processInfo.
ja: CommandLine.argumentsを使って引数にアクセスすることは、argumentsプロパティにProcessInfo.processInfo上でアクセスすることと等価です。

source: Accessor property attributes (getter= and setter=) are ignored by Swift.
ja: アクセッサプロパティ属性（getter=とsetter=）は、スウィフトによって無視されます。

source: Add the @NSManaged attribute to each property or method declaration in your managed object subclass that corresponds to an attribute or relationship in your Core Data model.
ja: あなたのコアデータモデルの中の属性またはリレーションシップに対応する、あなたの管理オブジェクトのサブクラスにおけるプロパティまたはメソッド宣言それぞれに、@NSManaged属性を加えてください。

source: Add the dynamic modifier and @objc attribute to any property you want to observe.
ja: dynamic修飾子と@objc属性をあなたが監視したい何らかのプロパティに加えてください。

source: Added a note about Swift target system requirements for executables built from the command line in the Setting Up Your Swift Environment section.
ja: コマンドラインからビルドされる実行形式に対するスウィフトターゲットシステム要件についての注意をあなたのスウィフト環境を設定するの章に加えた。

source: Added a note to the Enumerations section about initializing imported C enumerations with raw values.
ja: インポートされたC列挙を生の値で初期化することについての注意を列挙節へ加えた。

source: Added a note to the Option Sets section with information about imported C enumerations cases that have a value of 0.
ja: 注釈をオプションセット節へ加えて0の値を持つインポートされたC列挙ケース節についての情報を持たせた。

source: Added an example of the syntax for initializing unnamed fields to the Unnamed Structure and Union Fields section.
ja: 無名フィールドを初期化するための構文の例を無名構造体と共用体フィールドの節に加えた。

source: Added an implementation of deinit and a call to super in the last code sample in the Key-Value Observing section.
ja: deinitの実装とsuperへの呼び出しをキー値監視節での最後のコード例に加えた。

source: Added information about Objective-C class properties to the Accessing Properties section.
ja: Objective-Cクラスプロパティについての情報をプロパティにアクセスする節へ加えた。

source: Added information about autorelease pool blocks and the autoreleasepool(_:) function in the Autorelease Pools section.
ja: オートリリースプール・ブロックおよびautoreleasepool(_:)関数についての情報をオートリリースプールの節に加えた。

source: Added information about bridged value types and renamed types in the Swift Foundation overlay to the Working with Cocoa Frameworks chapter.
ja: Swift Foundationオーバーレイにおけるブリッジされた値型と新しい名前をつけられた型についての情報をココアフレームワークを扱う章へ加えた。

source: Added information about bridging between Dictionary and NSDictionary.
ja: DictionaryとNSDictionaryの間のブリッジについての情報を加えた。

source: Added information about defining a Swift protocol that Objective-C classes can conform to in the Declaring Protocols and Declaring a Swift Protocol That Can Be Adopted by an Objective-C Class sections.
ja: Objective-Cクラスが準拠することができるスウィフトプロトコルを定義することについての情報を、プロトコルを宣言するおよびObjective-Cクラスによって採用されることができるスウィフトプロトコルを宣言するの節に加えた。

source: Added information about global constants annotated with the NS_STRING_ENUM and NS_EXTENSIBLE_STRING_ENUM macros and functions annotated with the CF_SWIFT_NAME macro to the Interacting with C APIs chapter.
ja: NS_STRING_ENUMとNS_EXTENSIBLE_STRING_ENUMマクロで注釈を付けられたグローバル定数およびCF_SWIFT_NAMEマクロで注釈を付けられた関数についての情報をC APIとの相互作用章へ加えた。

source: Added information about how nil is bridged to NSNull to the Bridging Optionals to Nonnullable Objects section.
ja: nilがNSNullへとブリッジされる方法についての情報をオプショナルをnull不可オブジェクトへブリッジするの節に加えた。

source: Added information about how nullable pointers are imported as optionals to the Null Pointers section.
ja: null許容ポインタがオプショナルとしてインポートされる方法についての情報をnullポインタ節へ加えた。

source: Added information about how some Objective-C structures are bridged as instances of the NSValue class to the Cocoa Structures section.
ja: いくつかのObjective-C構造体がNSValueクラスのインスタンスとしてブリッジされる方法についての情報をCocoa構造体の節に加えた。

source: Added information about imported Objective-C classes with generic parameterization to the Lightweight Generics section.
ja: 総称体パラメータ表現でインポートされたObjective-Cクラスについての情報を軽量総称体節へ加えた。

source: Added information about low-level access to memory to the Buffer Pointers section.
ja: メモリへの低水準アクセスについての情報をバッファポインタの節に加えた。

source: Added information about performing unsafe pointer operations to the Pointer Arithmetic section.
ja: 非安全ポインタ操作を実行することについての情報をポインタ算術節へ加えた。

source: Added information about the #keyPath expression to the Keys and Key Paths section.
ja: #keyPath式についての情報をキーとキーパス章へ加えた。

source: Added information about the #selector expression to the Selectors section.
ja: #selector式についての情報をセレクタ節へ加えた。

source: Added information about the NS_TYPED_ENUM and NS_TYPED_EXTENSIBLE_ENUM macros to the Imported Constant Enumerations and Structures section.
ja: NS_TYPED_ENUMおよびNS_TYPED_EXTENSIBLE_ENUMマクロについての情報をインポートされる定数列挙と構造体の節に加えた。

source: Added information about the os_log(_:dso:log:type:_:) function in the Unified Logging section.
ja: os_log(_:dso:log:type:_:)関数についての情報を統合ログの節に加えた。

source: Added information about the new key-path expression syntax to the Keys and Key Paths section.
ja: 新しいキーパス式構文についての情報をキーとキーパスの節に加えた。

source: Added information about thread-safe initialization to the One-Time Initialization section of the Interacting with C APIs chapter.
ja: スレッド安全初期化についての情報をC APIとの相互作用章のワンタイム初期化節に加えた。

source: Added the API Availability section to the Adopting Cocoa Design Patterns chapter.
ja: API有効性の節をココア・デザインパターンの採用の章に加えた。

source: Added the Adding Availability Information to Objective-C APIs section to the Swift and Objective-C in the Same Project chapter.
ja: 利用可能性情報をObjective-C APIに加えるの節を同じプロジェクトの中のSwiftとObjective-Cの章に加えた。

source: Added the Avoiding Strong Reference Cycles When Capturing self section to the Interacting with Objective-C APIs chapter.
ja: 節強い参照循環を自身をキャプチャするときに避けるを章Objective-C APIとの相互作用に加えた。

source: Added the Bit Fields section and updated the Unions section in the Interacting with C APIs chapter.
ja: ビットフィールド節の追加と共用体節の更新をC APIとの相互作用章で行った。

source: Added the Catching and Handling Custom Errors section with information about how to handle custom errors defined using the NS_ERROR_ENUM macro.
ja: カスタムエラーを捕えて処理するの節をNS_ERROR_ENUMマクロを使って定義されたカスタムエラーを取り扱う方法についての情報とともに追加した。

source: Added the Catching and Handling an Error section to the Adopting Cocoa Design Patterns chapter.
ja: エラーを捕えて処理するの節をココア・デザインパターンの採用の章に加えた。

source: Added the Converting Errors to Optional Values section to the Adopting Cocoa Design Patterns chapter with information about the try? keyword.
ja: エラーをオプショナル値に変換するの節を加えて、ココア・デザインパターンの採用の章がtry?キーワードについての情報を持つようにした。

source: Added the Data Type Size Calculation section to the Interacting with C APIs chapter with information about the sizeof, sizeofValue, strideof, and strideOfValue functions.
ja: データ型サイズ計算節を加えてC APIとの相互作用章にsizeof、sizeofValue、strideof、そしてstrideOfValue関数についての情報をもたせた。

source: Added the Error Handling section to the Adopting Cocoa Design Patterns chapter.
ja: エラーの処理の節をココア・デザインパターンの採用の章に加えた。

source: Added the Failable Initialization section to the Interacting with Objective-C APIs chapter.
ja: 失敗できる初期化の節をObjective-C APIとの相互作用の章に加えた。

source: Added the Key-Value Observing section to the Adopting Cocoa Design Patterns chapter.
ja: 節キー値監視を章Cocoaデザインパターンの採用に加えた。

source: Added the Lazy Initialization section to the Adopting Cocoa Design Patterns chapter.
ja: 遅延初期化の節をココア・デザインパターンの採用の章に加えた。

source: Added the Making Objective-C Interfaces Unavailable in Swift section to the Swift and Objective-C in the Same Project chapter.
ja: スウィフトで利用できないObjective-Cインターフェイスを作る節を同じプロジェクト中のスウィフトとObjective-C章に加えた。

source: Added the Memory Managed Objects section to the Working with Cocoa Frameworks chapter.
ja: メモリ管理オブジェクトの節をココアフレームワークを扱うの章に加えた。

source: Added the NSCoding section to the Interacting with Objective-C APIs chapter.
ja: NSCodingプロトコルの節をObjective-C APIとの相互作用の章に加えた。

source: Added the Option Sets section to the Interacting with C APIs chapter.
ja: オプションセットの節をC APIとの相互作用の章に加えた。

source: Added the Overriding Swift Names for Objective-C Interfaces section to the Interacting with Objective-C APIs chapter.
ja: Objective-Cインターフェイスのためのスウィフト名のオーバーライドの節をObjective-C APIとの相互作用の章に加えた。

source: Added the Processing Command-Line Arguments section to the Adopting Cocoa Design Patterns chapter with information about reading command line flags.
ja: コマンドライン引数の処理節を加えてココア・デザインパターンの採用章がコマンドラインフラグの読み込みについての情報を持つようにした。

source: Added the Refining Objective-C Declarations section to the Swift and Objective-C in the Same Project chapter with information about the NS_REFINED_FOR_SWIFT macro.
ja: Objective-C宣言を改良するの節を加えて、同じプロジェクト中のスウィフトとObjective-Cの章がNS_REFINED_FOR_SWIFTマクロについての情報を持つようにした。

source: Added the Requiring Dynamic Dispatch section to the Interacting with Objective-C APIs chapter.
ja: 節動的ディスパッチの必要を章Objective-C APIとの相互作用に加えた。

source: Added the Serialization section to the Adopting Cocoa Design Patterns chapter with information about serializing objects.
ja: シリアライズ節をココア・デザインパターンの採用章に加えてオブジェクトのシリアライズについての情報を持つようにした。

source: Added the Sets section to the Working with Cocoa Frameworks chapter.
ja: 集合の節をココアフレームワークを扱うの章に加えた。

source: Added the Singleton section to the Adopting Cocoa Design Patterns chapter.
ja: 節シングルトンを章ココア・デザインパターンの採用に加えた。

source: Added the Throwing an Error section to the Adopting Cocoa Design Patterns chapter.
ja: エラーをスローするの節をココア・デザインパターンの採用の章に加えた。

source: Added the Undo section to the Adopting Cocoa Design Patterns chapter with information about implementing undo support.
ja: 取り消し節を加えてココア・デザインパターンの採用章がアンドゥサポート実装についての情報を持つようにした。

source: Added the Unions section to the Interacting with C APIs chapter.
ja: 共用体の節をC APIとの相互作用の章に加えた。

source: Added the Unnamed Structure and Union Fields section to the Interacting with C APIs chapter.
ja: 無名の構造体と共用体フィールド節をC APIとの相互作用章に加えた。

source: Added the Unrecognized Selectors and Optional Chaining section and the Downcasting Any section to the Interacting with Objective-C APIs chapter.
ja: 識別不能セレクタとオプショナル連鎖節とAnyのダウンキャスト節をObjective-C APIとの相互作用章に加えた。

source: Added the Unsafe Invocation of Objective-C Methods section to the Interacting with Objective-C APIs chapter now that the performSelector API family is available in Swift.
ja: Objective-Cメソッドの安全でない発動節をObjective-C APIとの相互作用章に加えた、今ではperformSelector APIファミリはスウィフトで利用可能です。

source: Added the Using Swift Class Names with Objective-C APIs section to the Writing Swift Classes and Protocols with Objective-C Behavior chapter.
ja: 節スウィフトクラス名をObjective-C APIで使うを章スウィフトのクラスとプロトコルをObjective-C挙動で書くに加えた。

source: Added the Variadic Functions section to the Interacting with C APIs chapter.
ja: 可変長引数関数の節をC APIとの相互作用の章に加えた。

source: Added to the Nullability and Optionals section in the Interacting with Objective-C APIs chapter.
ja: 節ヌル許可とオプショナルを章Objective-C APIとの相互作用に加えた。

source: Added various references to tvOS and watchOS platform support.
ja: 種々の参照をtvOSとwatchOSプラットホームサポートに対して加えた。

source: Adding Availability Information to Objective-C APIs
ja: 利用可能性情報をObjective-C APIに加える

source: Additionally, unlike Objective-C, in Swift there is no separate memory allocation method to invoke.
ja: その上に、Objective-Cと違って、スウィフトでは別々のメモリ割り当てメソッドが呼ばれることはありません。

source: Additionally, you can use catch clauses to match on particular error codes as a convenient way to differentiate possible failure conditions:
ja: 加えて、あなたは、起こりうる失敗条件を見分ける便利な方法として、catch節を特定のエラーコードで一致するように使うことができます。

source: Adopting Cocoa Design Patterns
ja: ココア・デザインパターンの採用

source: Adopting Protocols
ja: プロトコルを採用する

source: Adopting a Swift Protocol in an Objective-C Implementation
ja: スウィフトプロトコルをObjective-C実装において採用する

source: After You Finish
ja: あなたがやり終えたあと

source: After the Cake structure has been imported, you can initialize it and use it as follows:
ja: Cake構造体がインポートされてしまった後、あなたはそれを初期化してそれを以下のように使うことができます：

source: After you add the custom view to Interface Builder (by setting the custom class of the view in the inspector pane), Interface Builder renders your view in the canvas.
ja: あなたがカスタムメイドのビューをインタフェースビルダーに加えた（インスペクターペインにおいてそのビューのカスタム・クラスを設定することによって）後に、インタフェースビルダーはキャンバスにおいてあなたのビューを描画します。

source: After you add your custom view to Interface Builder, you can edit these properties in the inspector.
ja: あなたがあなたのカスタムメイドのビューをインタフェースビルダーに加えたあと、あなたはインスペクターにおいてこれらのプロパティを編集することができます。

source: After you have your Xcode project set up, you can import any framework from Cocoa or Cocoa Touch to start working with Objective-C from Swift.
ja: あなたが、あなたのXcodeプロジェクトを設定した後は、あなたはどんなフレームワークでもCocoaまたはCocoa Touchからインポートすることで、スウィフトからObjective-Cを扱うことができます。

source: After you import an Objective-C framework, you can instantiate classes from it and interact with them using native Swift syntax.
ja: あなたがObjective-Cフレームワークをインポートしたあと、あなたはそれからのクラスをインスタンス化することができて、スウィフト本来の構文を使ってそれらと相互に作用することができます。

source: All Objective-C generic type parameters imported by Swift have a type constraint that requires that type to be a class (T: Any).
ja: スウィフトによってインポートされる全てのObjective-C総称体型パラメータは、ある型制約を持ちます、それはあるクラス（T: Any）であることをその型に要求します。

source: All indirectly returned Core Foundation objects are unmanaged as well.
ja: 全ての間接的に返されたコアファウンデーション・オブジェクトは、同様に管理されません。

source: All of the Cocoa APIs provide availability information, so you can be confident the code you write works as expected on any of the platforms your app targets.
ja: Cocoa APIの全ては、有効性情報を提供します、それであなたは、あなたの書くコードが予想されるようにあなたのアプリがターゲットにするどのプラットホーム上でも機能すると確信することができます。

source: All selector pieces are required at the call site.
ja: 全てのセレクタ片は、呼び出し現場で必須とされます。

source: Alongside these Swift modules are generated Objective-C headers.
ja: それと並んでこれらのスウィフトモジュールは、Objective-Cヘッダを生成されます。

source: Alternatively, you can check availability in a guard statement, which exits out of scope unless the current target satisfies the specified requirements.
ja: あるいはまた、あなたは有効性をguard文の中で使うことができます、それは現在のターゲットが指定された要件を満たさない限りスコープの外に退出します。

source: Alternatively, you can create a bridging header yourself by choosing File > New > File > (iOS, watchOS, tvOS, or macOS) > Source > Header File.
ja: 代わりに、あなたは橋渡しヘッダをあなた自身でFile > New > File > (iOS、watchOS、tvOS、またはmacOS) > Source > Header Fileを選ぶことによって作成することもできます。

source: Although Swift does not require forced unwrapping when calling methods on values of type AnyObject, it is recommended as a way to safeguard against unexpected behavior.
ja: とは言え、スウィフトはAnyObject型の値の上でメソッドを呼び出しているとき強制アンラップを必要としません、それは予期しない挙動に対抗して安全を守るための方法として推奨されます。

source: Although Swift doesn’t support unions, a C union imported as a Swift structure still behaves like a C union.
ja: スウィフトは共用体をサポートしないにもかかわらず、スウィフト構造体としてインポートされたC共用体は依然としてC共用体のように振る舞います。

source: Although Swift error handling resembles exception handling in Objective-C, it is entirely separate functionality.
ja: スウィフトエラー処理はObjective-Cでの例外処理に似ていますが、それは完全に関係のない機能です。

source: An AutoreleasingUnsafeMutablePointer<Type> value
ja: ひとつのAutoreleasingUnsafeMutablePointer<Type>値

source: An UnsafeMutablePointer<Type> value
ja: ひとつのUnsafeMutablePointer<Type>値

source: An UnsafePointer<Type>, UnsafeMutablePointer<Type>, or AutoreleasingUnsafeMutablePointer<Type> value, which is converted to UnsafePointer<Type> if necessary.
ja: ひとつのUnsafePointer<Type>、UnsafeMutablePointer<Type>、またはAutoreleasingUnsafeMutablePointer<Type>値、それは必要ならばUnsafePointer<Type>に変換されます。

source: An Objective-C class can adopt a Swift protocol in its implementation (.m) file by importing the Xcode-generated header for Swift code and using a class extension.
ja: Objective-Cクラスは、その実装（.m）ファイルにおいてスウィフトプロトコルを採用することが、スウィフトコードのためのXcode生成ヘッダをインポートすることとクラス拡張を使うことでできます。

source: An Objective-C class can conform a protocol declared in Swift in the same way that it would an Objective-C protocol, by implementing the required methods.
ja: Objective-Cクラスは、スウィフトで宣言されるプロトコルにそれがObjective-Cプロトコルにするのと同じ方法で、必須メソッドを実装することによって、準拠できます。
